КАКерамика_моя_старая_база/src/InformationRegisters/КонтурЛогистика_ПроизвольныеДанные/КонтурЛогистика_ПроизвольныеДанные.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>КонтурЛогистика_ПроизвольныеДанные</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Дата</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.КонтурЛогистика_Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>Реквизит1</name>
    <type>
      <types>CatalogRef.КонтурЛогистика_ГорючеСмазочныеМатериалы</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <comment>Из какого объекта произошла конвертация</comment>
    <type>
      <types>DefinedType.КонтурЛогистика_ДокументыУчетнойСистемы</types>
    </type>
  </attributes>
  <attributes>
    <name>НастройкаКонвертацииРС</name>
    <comment>Какая НКРС использовалась при синх. в 1С</comment>
    <type>
      <types>CatalogRef.КонтурЛогистика_НастройкиКонвертацииРегистровСведений</types>
    </type>
  </attributes>
  <attributes>
    <name>СинхронизацияССервисом</name>
    <type>
      <types>EnumRef.КонтурЛогистика_СтатусыСинхронизации</types>
    </type>
  </attributes>
  <attributes>
    <name>СинхронизацияСОбъектом1С</name>
    <type>
      <types>EnumRef.КонтурЛогистика_СтатусыСинхронизации</types>
    </type>
  </attributes>
  <attributes>
    <name>ДанныеХранилище</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекстОшибки</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <dimensions>
    <name>ОрганизацияДиадок</name>
    <type>
      <types>CatalogRef.КонтурЛогистика_ОрганизацииДиадок</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТипДанных</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Разрез1</name>
    <comment>Состав типо должен соответствовать Спр.НКРС.ОтборРазрез1</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Разрез2</name>
    <comment>Состав типо должен соответствовать Спр.НКРС.ОтборРазрез2</comment>
    <type>
      <types>EnumRef.КонтурЛогистика_ТипыПоказанийТоплива</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Разрез3</name>
    <comment>Состав типо должен соответствовать Спр.НКРС.ОтборРазрез3</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

КАКерамика_моя_старая_база/src/InformationRegisters/КонтурЛогистика_ПроизвольныеДанные/Forms/ФормаЗаписиПодписокИОплата/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ТолькоПросмотр = Истина;
	Заголовок = "Подписки и оплата";
	
	Элементы.ОрганизацияДиадок.ТолькоПросмотр = Истина;
	Элементы.Дата.ТолькоПросмотр = Истина;
	Элементы.ТекстОшибки.ТолькоПросмотр = Истина;
	Элементы.ДанныеТекст.ТолькоПросмотр = Истина;
	
	ЗаполнитьДанныеТекст();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьДанныеТекст()
	
	ДанныеХранилище = ПолучитьДанныеХранилищеЗаписи();
	
	Если ДанныеХранилище = Неопределено Тогда
		ДанныеТекст = "";
		Возврат;
	КонецЕсли;
	
	Данные = ДанныеХранилище.Получить();
	
	Если Данные = Неопределено Тогда
		ДанныеТекст = "";
		Возврат;
	КонецЕсли;
	
	ДанныеТекст = КонтурЛогистика_СтдJSONКлиентСервер.ЗаписатьЗначение(Данные);
	ДанныеТекст = ФорматироватьJSON(ДанныеТекст);
	
КонецПроцедуры

&НаСервере
Функция ПолучитьДанныеХранилищеЗаписи()
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ОрганизацияДиадок", Запись.ОрганизацияДиадок);
	Запрос.УстановитьПараметр("ТипДанных", Запись.ТипДанных);
	Запрос.УстановитьПараметр("Разрез1", Запись.Разрез1);
	Запрос.УстановитьПараметр("Разрез2", Запись.Разрез2);
	Запрос.УстановитьПараметр("Разрез3", Запись.Разрез3);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	КонтурЛогистика_ПроизвольныеДанные.ДанныеХранилище КАК ДанныеХранилище
	|ИЗ
	|	РегистрСведений.КонтурЛогистика_ПроизвольныеДанные КАК КонтурЛогистика_ПроизвольныеДанные
	|ГДЕ
	|	КонтурЛогистика_ПроизвольныеДанные.ОрганизацияДиадок = &ОрганизацияДиадок
	|	И КонтурЛогистика_ПроизвольныеДанные.ТипДанных = &ТипДанных
	|	И КонтурЛогистика_ПроизвольныеДанные.Разрез1 = &Разрез1
	|	И КонтурЛогистика_ПроизвольныеДанные.Разрез2 = &Разрез2
	|	И КонтурЛогистика_ПроизвольныеДанные.Разрез3 = &Разрез3";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	Выборка.Следующий();
	
	Возврат Выборка.ДанныеХранилище;
	
КонецФункции

&НаСервере
Функция ФорматироватьJSON(СтрокаJSON)
	
	Если Не ЗначениеЗаполнено(СтрокаJSON) Тогда
		Возврат "";
	КонецЕсли;
	
	Попытка
		
		ЧтениеJSON = Новый ЧтениеJSON;
		ЧтениеJSON.УстановитьСтроку(СтрокаJSON);
		ЗначениеJSON = ПрочитатьJSON(ЧтениеJSON);
		
		ЗаписьJSON = Новый ЗаписьJSON;
		ЗаписьJSON.УстановитьСтроку();
		ЗаписьJSON.ПереносСтрок = ПереносСтрокJSON.Авто;
		
		НастройкиСериализации = Новый НастройкиСериализацииJSON;
		НастройкиСериализации.ФорматСериализацииДаты = ФорматДатыJSON.ISO;
		
		ЗаписатьJSON(ЗаписьJSON, ЗначениеJSON, НастройкиСериализации);
		
		Возврат ЗаписьJSON.Закрыть();
		
	Исключение
		
		Возврат СтрокаJSON;
		
	КонецПопытки;
	
КонецФункции

#КонецОбласти
